[
    {
        "id": 4,
        "position": "Assistant Computer Science Instructor",
        "company": "Computer Science Department, Middlebury College",
        "duration": "September 2024 - Present",
        "location": "Middlebury, VT",
        "details": [
            "<b>Facilitates instruction</b> of 8 computer science courses, providing comprehensive support to CS students regarding assignments, course materials, and personal study guidance.",
            "Conducts 15+ hours of weekly office hours, delivering individualized assistance for introductory to advanced coursework in languages including <b>Python</b>, <b>C</b>, <b>Java</b>, and <b>Javascript</b>.",
            "Orchestrates the student course assistants program, <b>benefiting over 200+ students</b> by competently managing 30+ student course assistants with 50+ weekly help sessions."
        ]
    },
    {
        "id": 3,
        "position": "Full Stack Developer",
        "company": "Atom Grants",
        "duration": "September 2024 - March 2025",
        "location": "Remote",
        "details": [
            "<b>Led development</b> of web scraping scripts utilizing <b>OpenAI APIs</b> and <b>Cron Jobs</b> to automate data collection and processing from <b>1,200+ foundations</b>, generating formatted JSON for over <b>25,000 grants</b>.",
            "<b>Delivered production-ready code</b> at a <b>fast-paced startup</b> and managed customer data security.",
            "Hard Skills: <b>Next.js</b>, Tailwind, <b>TypeScript/Javascript</b>, Supabase (<b>PostgreSQL</b>), <b>Git</b>, RESTful APIs, Postman."
        ]
    },
    {
        "id": 2,
        "position": "Data Analyst and Developer",
        "company": "Eric Bleich MPoMP Lab, Middlebury College",
        "duration": "September 2023 - May 2024",
        "location": "Middlebury, VT",
        "details": [
            "Analyzed <b>600,000+ articles</b> on a small team with advanced textual analysis techniques in Python to discover emerging AI politicization and changes in the use of climate crisis terminology.",
            "Expanded viable data via Python, using the PyPdf library to convert PDFs into custom-formatted .txt files.",
            "Hard Skills: <b>Python</b>, Pandas, NumPy, <b>Matplotlib</b>, Textual and Quantitative Analysis Workflows."
        ]
    },
    {
        "id": 1,
        "position": "Machine Learning Engineer",
        "company": "Bing He Biological Research Lab, Dartmouth College",
        "duration": "August 2023 - October 2023",
        "location": "Remote",
        "details": [
            "Architected a computer vision model to classify cell stage development and expedite data collection.",
            "<b>Built entire ETL pipeline</b> using limited, unsupported image data.",
            "Hard Skills: <b>AWS</b> (SageMaker, S3, CloudWatch), PyTorch, OpenCV, <b>Python</b>, AI Image Classification."
        ]
    }
]

